# % 占位符
name = '张三'
age = 20
print('我叫%s,今年%d岁' % (name, age))

# {}
print('我叫{0},今年{1}岁'.format(name, age))

# f-string
print(f'我叫{name},今年{age}岁')

"""
我叫张三,今年20岁
我叫张三,今年20岁
我叫张三,今年20岁
"""

print('%10d' % 99) # 10表示的是宽度
print('%.3f' % 3.1415826) #　3表示是小数点后三位
# 同时表示宽度和精度
print('%10.3f' % 3.1415926) # 一共总宽度为10， 小数点后3位

"""
        99
3.142
     3.142
"""


print('hellohello')

print('{0:.3}'.format(3.1415924)) # .3表示的一共是3位数

print('{0:.3f}'.format(3.1415924)) # .3f表示是3位小数

print('{:10.3f}'.format(3.1415924)) # 同时设置宽度和精度， 一共是10位， 3位是小数

"""
hellohello
3.14
3.142
     3.142
"""

