tu = (10, [20,30], 40)
print(type(tu))
print(tu)
print(tu[0], type(tu[0]), id(tu[0]))
print(tu[1], type(tu[1]), id(tu[1]))
print(tu[2], type(tu[2]), id(tu[2]))

# 尝试将 tu[1] 指向100
# tu[1] = 100
print(id(100))
# tu[1]=100 # 元组是不允许修改元素

tu[1].append(100) # 向列表中添加元素
'''由于tu[1] 是列表（可变序列）， 所以可以向列表中添加元素， 而列表的内存地址不变'''
print(tu, id(tu[1]))

"""
<class 'tuple'>
(10, [20, 30], 40)
10 <class 'int'> 139974213438032
[20, 30] <class 'list'> 139974212368320
40 <class 'int'> 139974213438992
139974213629392
(10, [20, 30, 100], 40) 139974212368320
"""