# 假设： 一下类容是从网络上抓取的
# 要求： 顺序并且居中对齐输出一下内容
# poem = ["登鹳雀楼",
#         "王之涣",
#         "白日依山尽",
#         "黄河入海流",
#         "欲穷千里目",
#         "更上一层楼"]
#
# for poem_str in poem:
#
#     print("|%s|" % poem_str.center(10, "　"))
    # center 方法可居中对齐 平时用空格填充至长度 width 的新字符串
    # ljust 方法可法向左居中对齐 平时用空格填充至长度 width 的新字符串
    # rjust 方法可以向右居中对齐 平时用空格填充至长度 width 的新字符串
    # print("|%s|" % poem_str.ljust(10, "　"))
    # print("|%s|" % poem_str.rjust(10, "　"))

# 去除空白字符
poem_1 = ["\t\n登鹳雀楼",
        "王之涣",
        "白日依山尽\t\n",
        "黄河入海流",
        "欲穷千里目",
        "更上一层楼"]

for poem_str in poem_1:

    # 先使用strip方法去除字符串中的空白字符
    # 在使用center方法居中显示文本
    print("|%s|" % poem_str.strip().center(10, "　"))


# poem = ["登鹳雀楼",
#         "太阳依傍山峦渐渐下落",
#         "黄河向着大海滔滔东流",
#         "太阳依傍山峦渐渐下落",
#         "如果要想遍览千里风景",
#         "那就请再登上一层高楼"]
